-- 示例数据
张伟|2021-06-14 12:12:12|2021-06-14 18:12:12
王静|2021-06-14 13:12:12|2021-06-14 16:12:12
李强|2021-06-14 13:15:12|2021-06-14 20:12:12
李娜|2021-06-14 15:12:12|2021-06-14 16:12:12
王勇|2021-06-14 15:18:12|2021-06-14 20:12:12
张伟|2021-06-14 20:12:12|2021-06-14 23:12:12
李娟|2021-06-14 21:12:12|2021-06-14 23:15:12
张涛|2021-06-14 22:12:12|2021-06-14 23:10:12


-- 表结构
create table liuxu_test.author_room_online_info(
   author_name string comment '主播',
   stt string comment '上线时间',
   edt string comment '下线时间'
) comment '主播上下线信息记录表'
row format delimited
FIELDS TERMINATED BY '|'
LINES TERMINATED BY '\n';